Revit 2027 API
IExternalDataManagerServer.GetPreviewImageFile Method
 Retrieves the handle of preview image.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetPreviewImageFile(
	Document document,
	ExternalDataManagerDataItemId dataId
)
Function GetPreviewImageFile (
	document As Document,
	dataId As ExternalDataManagerDataItemId
) As String
String^ GetPreviewImageFile(
	Document^ document,
	ExternalDataManagerDataItemId^ dataId
)
abstract GetPreviewImageFile :
        document : Document *
        dataId : ExternalDataManagerDataItemId -> string
Parameters
document Document
 The document.
dataId ExternalDataManagerDataItemId
 The id of data.
Return Value
String
 The path of the preview image file.
Remarks
 Alternative to getPreviewImage: provide a temporary file path that contains the preview bitmap. Useful when the preview is larger than what can reasonably be kept in memory or when the generation happens in another process.
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace